

GREETING_TEXT = 'Вітаємо у OCR Бот! Я допоможу вам розпізнати текст на ваших зображеннях. Просто надішліть мені зображення і виберіть одну з моделей для розпізнавання.'

HELP = 'OCR Бот - це інструмент, який допомагає розпізнати друкований текст на скріншотах. ' \
       'Ви можете використовувати цей бот для швидкого перетворення зображень тексту в редагований формат. ' \
       'Просто надішліть мені зображення з текстом, виберіть модель для розпізнавання, і я поверну вам текст, ' \
       'який був розпізнаний на вашому зображенні. '

# START_OCR = 'Будь ласка, завантажте зображення друкованого тексту в хорошій якості, на якому ви хочете розпізнати текст'

CHOISE_MODEL = 'Будь ласка, спочатку оберіть модель, за допомогою якої будемо передбачати зображення.'

CHOISE_MODEL2 = '''1) Покращена модель для української мови

2) Альтернативна версія моделі для української мови'''



START_BUTTON = 'Почати розпізнавання'


MODEL1 = "модель 1"
MODEL2 = "модель 2"



WAIT_MODEL = 'Зачекайте трохи, ваше зображення обробляється...'
